#include <stdio.h>

void print_type()
{
    printf("\n===================================\n");
    printf("        КОНСОЛЬНОЕ МЕНЮ            \n");
    printf("===================================\n");
    printf("           ТИПЫ ДАННЫХ             \n");
    printf("1. Работа с матрицей целых чисел.\n");
    printf("2. Работа с матрицей дробных чисел.\n");
    printf("3. Работа с матрицей комплексных чисел.\n");
    printf("0. Выход.\n");
    printf("===================================\n");
    printf("Ваш выбор: ");
}

void print_menu()
{
    printf("===================================\n");
    printf("        КОНСОЛЬНОЕ МЕНЮ            \n");
    printf("===================================\n");
    printf("      Прямоугольная матрица        \n");
    printf("1. Сложение матриц\n");
    printf("2. Произведение матриц\n");
    printf("3. Транспонирование матрицы\n");
    printf("4. Прибавление к строке линейной комбинации других строк\n");
    printf("0. Выход.\n");
    printf("===================================\n");
    printf("Ваш выбор: ");
}

void process(int choice, int type)
{
    if(type == 0)
    {
        return;
    }
    switch (choice)
    {
    case 0:
        printf("Выход из программы!\n");
        return;
    case 1:
        break;
    case 2:
        break;
    case 3:
        break;
    case 4:
        break;
    default:
        printf("Неправильный выбор! Выберите действие из представленных в меню!\n");
        break;
    }
}